---
kind: method
id: M:Autodesk.Revit.DB.ScheduleHeightsOnSheet.GetBodyRowHeights
source: html/86ed7231-000a-3717-86f2-ac1faa69bbfe.htm
---
# Autodesk.Revit.DB.ScheduleHeightsOnSheet.GetBodyRowHeights Method

Returns each row's height of schedule body on sheet view.

## Syntax (C#)
```csharp
public IList<double> GetBodyRowHeights()
```

## Returns
Each row's height of schedule body on sheet view.